; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 779035 1 2 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star4 - direction
	GroundStation6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Phenomenon7 thermograph3)
	(have_image Planet8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Star10 image1)
	(have_image Star11 image1)
	(have_image Phenomenon12 thermograph3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star4 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star4)
   goals met: 0 of 7
5. (turn_to satellite0 star11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star11)
   goals met: 0 of 7
6. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 1 of 7
7. (turn_to satellite0 star4 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star4)
   goals met: 1 of 7
8. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
9. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 2 of 7
10. (turn_to satellite0 star4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star4)
   goals met: 2 of 7
11. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
12. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 3 of 7
13. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 3 of 7
14. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 3 of 7
15. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 4 of 7
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 7
17. (turn_to satellite0 star4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star4)
   goals met: 4 of 7
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 7
19. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 7
20. (turn_to satellite0 star1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
21. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 7
22. (take_image satellite0 phenomenon7 instrument0 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 5 of 7
23. (turn_to satellite0 star1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star1)
   goals met: 6 of 7
24. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 7
25. (take_image satellite0 phenomenon12 instrument0 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 6 of 7
26. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 7 of 7
